w4/contact_app/app/controllers/contacts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "contacts".* FROM "contacts" INNER JOIN "contact_shares" ON "contacts"."id" = "contact_shares"."contact_id" WHERE "contact_shares"."user_id" = ?  [["user_id", 1]]
---
  def index
    render json: User.find(params[:user_id]).contacts + User.find(params[:user_id]).shared_contacts

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    contact = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "'david'"], ["email", "'david@appacademy.io'"], ["user_id", 1], ["created_at", "2015-01-05 23:48:12.798844"], ["updated_at", "2015-01-05 23:48:12.798844"]]
---
  def create
    contact = Contact.new(contact_params)
    if contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "contacts" SET "name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "'David'"], ["updated_at", "2015-01-05 23:48:49.160410"], ["id", 4]]
---
  def update
    contact = Contact.find(params[:id])
    if contact.update(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 4]]
---
  def destroy
    contact = Contact.find(params[:id])
    render json: contact
    contact.destroy