w4/contact_app/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Gizmo"], ["email", "gizmo@gizmo.gizmo"], ["created_at", "2015-01-05 21:52:28.039652"], ["updated_at", "2015-01-05 21:52:28.039652"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    user = User.find(params[:id])
    render json: user
    user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "contacts".* FROM "contacts" INNER JOIN "contact_shares" "shares_contacts" ON "shares_contacts"."contact_id" = "contacts"."id" INNER JOIN "contact_shares" ON "contacts"."id" = "contact_shares"."contact_id" WHERE "contact_shares"."user_id" = ? AND "contact_shares"."favorite" = 't'  [["user_id", 1]]
---
  def favorites
    user = User.find(params[:id])
    favorite_contacts = user.contacts.where(favorite: true)